//플레이어 HP가 0일때

//텍스트 문구 [You Win]

//텍스트 문구 [던전에서 몬스터 2마리를 잡았습니다.]
    //던전에 출몰한 몬스터가 몇마리인지 파악해서 불려와야함

//텍스트 문구 [Lv. 이름]
//텍스트 문구 [HP 00 -> 00]
    //플레이어가 전투를 시작할때 HP, 전투가 끝났을때 HP를 파악해서 불려와야함

//텍스트 문구 [1. 다음]
    //선택시 battle페이지로 이동함
//텍스트 문구 [2. 던전나가기]
    //선택시 시작페이지로 이동함

//텍스트 문구 [원하는 행동을 입력해주세요.]

/////////////////////////////////////////////////////////

//몬스터가 전부 Dead일때 or 몬스터의 HP가 전부 0일때

//텍스트 문구 [You Lose]

//텍스트 문구 [Lv. 이름]
//텍스트 문구 [HP 00 -> 0]
    //플레이어가 전투를 시작할때 HP를 파악해서 불려와야함

//텍스트 문구 [1. 마을에서 부활하기]
    //선택시 시작패이지로 이동함 or 게임초기화해야함
//텍스트 문구 [2. 게임종료하기]
    //선택시 게임종료함