
using TRpg;

public static class BattleEndPg
{
    private static List<Item> RewardItems = new List<Item> //수정 : Item 클래스에 맞게 수정
    {
        new Item("전사의 검", ItemType.Weapon, 20, 0, 500, "전사들이 애용하는 검"),
        new Item("수호자의 방패", ItemType.Armor, 20, 0, 500, "튼튼한 방패"),
        new Item("포션병", ItemType.Weapon, 20, 0, 1000,"수상할 정도로 부서지지 않는 포션병이다.")
    };


    public static void StageClear(Player player, int gold = 0)
    {
        if (!player.IsDead)
        {
            Console.Clear();
            Console.WriteLine("\n\n_      `-._     `-.     `.   \\      :      /   .'     .-'     _.-'      _\r\n `--._     `-._    `-.    `.  `.    :    .'  .'    .-'    _.-'     _.--'\r\n      `--._    `-._   `-.   `.  \\   :   /  .'   .-'   _.-'    _.--'\r\n`--.__     `--._   `-._  `-.  `. `. : .' .'  .-'  _.-'   _.--'     __.--'\r\n__    `--.__    `--._  `-._ `-. `. \\:/ .' .-' _.-'  _.--'    __.--'    __\r\n  `--..__   `--.__   `--._ `-._`-.`_=_'.-'_.-' _.--'   __.--'   __..--'\r\n--..__   `--..__  `--.__  `--._`-q(-_-)p-'_.--'  __.--'  __..--'   __..--\r\n      ``--..__  `--..__ `--.__ `-'_) (_`-' __.--' __..--'  __..--''\r\n...___        ``--..__ `--..__`--/__/  \\--'__..--' __..--''        ___...\r\n      ```---...___    ``--..__`_(<_   _/)_'__..--''    ___...---'''\r\n```-----....._____```---...___(__\\_\\_|_/__)___...---'''_____.....-----'''");
            Console.WriteLine("\n  ___    ___  ________   ___  ___          ___       __    ___   ________      \r\n |\\  \\  /  /||\\   __  \\ |\\  \\|\\  \\        |\\  \\     |\\  \\ |\\  \\ |\\   ___  \\    \r\n \\ \\  \\/  / /\\ \\  \\|\\  \\\\ \\  \\\\\\  \\       \\ \\  \\    \\ \\  \\\\ \\  \\\\ \\  \\\\ \\  \\   \r\n  \\ \\    / /  \\ \\  \\\\\\  \\\\ \\  \\\\\\  \\       \\ \\  \\  __\\ \\  \\\\ \\  \\\\ \\  \\\\ \\  \\  \r\n   \\/  /  /    \\ \\  \\\\\\  \\\\ \\  \\\\\\  \\       \\ \\  \\|\\__\\_\\  \\\\ \\  \\\\ \\  \\\\ \\  \\ \r\n __/  / /       \\ \\_______\\\\ \\_______\\       \\ \\____________\\\\ \\__\\\\ \\__\\\\ \\__\\\r\n|\\___/ /         \\|_______| \\|_______|        \\|____________| \\|__| \\|__| \\|__|\r\n\\|___|/                                                                        \r\n                                                                               \r\n                                                                               ");
            Console.WriteLine($"\n\n***** {player.Name}가 몬스터를 물리쳤습니다! *****");
            Console.WriteLine();
            player.Gold += gold;
            Console.WriteLine($"골드 {gold}G 획득!");

            // 아이템 보상 지급
            Item rewardItem = RewardItems[new Random().Next(RewardItems.Count)];
            Console.WriteLine($"아이템 획득: {rewardItem.Name}");
            Inventory.inventory.AddItem(rewardItem);

            Console.WriteLine("1. 마을로 이동하기");
            Console.WriteLine();
            Console.Write("\n당신의 선택: ");
            Console.Write("\n>>");

            string input = Console.ReadLine();
            switch (input)
            {
                case "1":
                    Program.Town(player);
                    break;
                default:
                    Console.WriteLine("잘못된 입력입니다. 다시 입력해주세요.");
                    break;
            }
        }
        else
        {
            Console.Clear();
            Console.WriteLine("\n  ___    ___  ________   ___  ___          ___        ________   ________   _______      \r\n |\\  \\  /  /||\\   __  \\ |\\  \\|\\  \\        |\\  \\      |\\   __  \\ |\\   ____\\ |\\  ___ \\     \r\n \\ \\  \\/  / /\\ \\  \\|\\  \\\\ \\  \\\\\\  \\       \\ \\  \\     \\ \\  \\|\\  \\\\ \\  \\___|_\\ \\   __/|    \r\n  \\ \\    / /  \\ \\  \\\\\\  \\\\ \\  \\\\\\  \\       \\ \\  \\     \\ \\  \\\\\\  \\\\ \\_____  \\\\ \\  \\_|/__  \r\n   \\/  /  /    \\ \\  \\\\\\  \\\\ \\  \\\\\\  \\       \\ \\  \\____ \\ \\  \\\\\\  \\\\|____|\\  \\\\ \\  \\_|\\ \\ \r\n __/  / /       \\ \\_______\\\\ \\_______\\       \\ \\_______\\\\ \\_______\\ ____\\_\\  \\\\ \\_______\\\r\n|\\___/ /         \\|_______| \\|_______|        \\|_______| \\|_______||\\_________\\\\|_______|\r\n\\|___|/                                                            \\|_________|          \r\n                                                                                         \r\n                                                                                         ");
            Console.WriteLine("\n                                         .\"\"--..__\r\n                     _                     []       ``-.._\r\n                  .'` `'.                  ||__           `-._\r\n                 /    ,-.\\                 ||_ ```---..__     `-.\r\n                /    /:::\\\\               /|//}          ``--._  `.\r\n                |    |:::||              |////}                `-. \\\r\n                |    |:::||             //'///                    `.\\\r\n                |    |:::||            //  ||'                      `|\r\n                /    |:::|/        _,-//\\  ||\r\n               /`    |:::|`-,__,-'`  |/  \\ ||\r\n             /`  |   |'' ||           \\   |||\r\n           /`    \\   |   ||            |  /||\r\n         |`       |  |   |)            \\ | ||\r\n        |          \\ |   /      ,.__    \\| ||\r\n        /           `         /`    `\\   | ||\r\n       |                     /        \\  / ||\r\n       |                     |        | /  ||\r\n       /         /           |        `(   ||\r\n      /          .           /          )  ||\r\n     |            \\          |     ________||\r\n    /             |          /     `-------.|\r\n   |\\            /          |              ||\r\n   \\/`-._       |           /              ||\r\n    //   `.    /`           |              ||\r\n   //`.    `. |             \\              ||\r\n  ///\\ `-._  )/             |              ||\r\n //// )   .(/               |              ||\r\n ||||   ,'` )               /              //\r\n ||||  /                    /             || \r\n `\\\\` /`                    |             // \r\n     |`                     \\            ||  \r\n    /                        |           //  \r\n  /`                          \\         //   \r\n/`                            |        ||    \r\n`-.___,-.      .-.        ___,'        (/    \r\n         `---'`   `'----'`");
            Console.WriteLine("0. 게임 종료");
            Console.WriteLine();
            Console.Write("\n당신의 선택: ");

            string input = Console.ReadLine();
            switch (input)
            {
                case "0":
                    Console.WriteLine("게임을 종료합니다.");
                    Console.ReadKey(true);
                    Environment.Exit(0);
                    break;
                default: // 수정 : 0이 아닐 때 적용
                    Console.WriteLine("미구현입니다. 게임을 종료합니다.");
                    Console.ReadKey(true);
                    Environment.Exit(0);
                    break;
            }
        }
    }
}